# Поляков Андрей Игоревич ИУ7-12Б
# Решение квадратных уравнений
a = float(input("Введите а: "))  # ввод коэффициента а
b = float(input("Введите b: "))  # ввод b
c = float(input("Введите c: "))  # ввод c

if a == 0:
    if b == 0:
        if c == 0:
            print("x - любое число")
        else:
            print("")
    else:
        x = -c / b  # вычисляем единственный корень
        print("x = {0:.7g}".format(x))
else:
    d = b ** 2 - 4 * a * c  # нахождение дискриминанта
    if d > 0:  # два корня
        x1 = (-b + d ** 0.5) / (2 * a)
        x2 = (-b - d ** 0.5) / (2 * a)
        print("x1 = {0:.7g} \nx2 = {1:.7g}".format(x1, x2))
    elif d == 0:  # один корень
        x = -b/(2*a)
        print("x = {0:.7g}".format(x))
    else:  # нет корней
        print("Корней нет")
